#### RailConnectionOption Enumeration

---

|  |
| --- |
| See Also |

The connections between rails.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public enum RailConnectionOption ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration RailConnectionOption ``` |

| Visual C++ |
| --- |
| ``` public enum class RailConnectionOption ``` |

# Members

| Member name | Description |
| --- | --- |
| Trim | Rails will be trimmed and cut with a vertical plane. |
| Weld | Rails will be joined in a manner as close to a miter as possible. |

# See Also

Autodesk.Revit.DB.Architecture Namespace